tap "FelixKratz/formulae"

brew "borders"
brew "delta"
brew "eza"
brew "fzf"
brew "git"
brew "lazygit"
brew "neofetch"
brew "neovim"
brew "pnpm"
brew "skhd"
brew "starship"
brew "stow"
brew "tmux"
brew "tree-sitter-cli"
brew "yabai"
brew "zoxide"

cask "wezterm"
